#### Combine Data Set
 - 결합 : merge, concat
    - 위/아래, 왼쪽/오른쪽 연결
    - pd.concat([데이터프레임...])
- merge
    - sql join 개념과 동일
    - inner, outer

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series(["a","b"])
s2 = pd.Series(["c","d"])

In [5]:
s1
s2

0    c
1    d
dtype: object

In [7]:
# concat() : 아래로 합치기
# pd.concat([s1,s2])
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [10]:
data = [
    ["a",1],
    ["b",2]
]

df = pd.DataFrame(data, columns=["letter","number"])
df

  letter  number
0      a       1
1      b       2

In [11]:
data = [
    ["c",3],
    ["d",4]
]

df2 = pd.DataFrame(data, columns=["letter","number"])
df2

  letter  number
0      c       3
1      d       4

In [13]:
pd.concat([df,df2],ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [14]:
data = [
    ["e",5, "cat"],
    ["f",6, "dog"]
]

df3 = pd.DataFrame(data, columns=["letter","number","animal"])
df3

  letter  number animal
0      e       5    cat
1      f       6    dog

In [18]:
# df, df3 결합

pd.concat([df,df3], ignore_index=True, sort=True)

  animal letter  number
0    NaN      a       1
1    NaN      b       2
2    cat      e       5
3    dog      f       6

In [25]:
# join
# inner : 첫번째 df 기준
# outer : 두번째 df 기준(default)

pd.concat([df,df3],ignore_index=True, sort=True, join="outer")

  animal letter  number
0    NaN      a       1
1    NaN      b       2
2    cat      e       5
3    dog      f       6

In [28]:
# axis=1 : 컬럼기준(옆으로 결합)
pd.concat([df,df2],axis=1)

  letter  number letter  number
0      a       1      c       3
1      b       2      d       4

In [31]:
df4 = pd.DataFrame([1], index=["a"])
df5 = pd.DataFrame([2], index=["a"])

In [34]:
df4

   0
a  1

In [40]:
# pd.concat([df4,df5], ignore_index=True)

# ValueError : Indexes have overlapping values
# pd.concat([df4,df5], verify_integrity=True)
pd.concat([df4,df5])

   0
a  1
a  2

In [42]:
df1 = pd.DataFrame(
    {
        "name":["John","Nate","Red"],
        "job":["teacher","student","developer"],
    }
)

df2 = pd.DataFrame(
    {
        "age":[25,30,45],
        "job":["u.s","u.k","korea"],
    }
)

In [44]:
# df1, df2 결합(위, 아래)
pd.concat([df1,df2],ignore_index=True)

   name        job   age
0  John    teacher   NaN
1  Nate    student   NaN
2   Red  developer   NaN
3   NaN        u.s  25.0
4   NaN        u.k  30.0
5   NaN      korea  45.0

In [47]:
# df1, df2 결합(옆으로)
pd.concat([df1,df2],axis=1)

   name        job  age    job
0  John    teacher   25    u.s
1  Nate    student   30    u.k
2   Red  developer   45  korea

In [48]:
# merge(sql join 과 유사)

df1 = pd.DataFrame({"x1": ["A","B","C"], "x2":[1,2,3]})
df2 = pd.DataFrame({"x1": ["A","B","D"], "x2":["T","F","T"]})

In [52]:
# 왼쪽 column의 x1을 기준으로 일치하면 결합
pd.merge(df1,df2, how="left", on="x1")

  x1  x2_x x2_y
0  A     1    T
1  B     2    F
2  C     3  NaN

In [53]:
# 왼쪽 column의 x1을 기준으로 일치하면 결합
pd.merge(df1,df2, how="outer", on="x1")

  x1  x2_x x2_y
0  A   1.0    T
1  B   2.0    F
2  C   3.0  NaN
3  D   NaN    T

In [54]:
pd.merge(df1,df2, how="outer", on="x1", indicator=True)

  x1  x2_x x2_y      _merge
0  A   1.0    T        both
1  B   2.0    F        both
2  C   3.0  NaN   left_only
3  D   NaN    T  right_only